{"config": [{"config": {"kernel_regularizer": null, "filters": 32, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "name": "conv2d_1", "activity_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "trainable": true}, "class_name": "Conv2D"}, {"config": {"kernel_regularizer": null, "filters": 64, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "name": "conv2d_2", "activity_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "name": "dense_1", "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "units": 128, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "name": "dense_2", "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "units": 10, "bias_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.4", "class_name": "Sequential"}